Angular/src/assets/quote.xml

<?xml version='1.0' encoding='UTF-8'?><!-- Published by JAX-WS RI (http://jax-ws.java.net). RI's version is Metro/2.4.3.payara-p3 (2.4.3.payara-maintenance-a5c1c68; 2019-06-17T14:04:38+0200) JAXWS-RI/2.3.2.payara-p2 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. --><!-- Generated by JAX-WS RI (https://github.com/eclipse-ee4j/metro-jax-ws). RI's version is Metro/2.4.3.payara-p3 (2.4.3.payara-maintenance-a5c1c68; 2019-06-17T14:04:38+0200) JAXWS-RI/2.3.2.payara-p2 JAXWS-API/2.3.2 JAXB-RI/2.3.2 JAXB-API/2.3.2 git-revision#unknown. -->
<definitions
  xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
  xmlns:tns="http://SOAPwebservices.dev/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://SOAPwebservices.dev/" name="QuoteSoapServiceService">
  <types>
    <xsd:schema>
      <xsd:import namespace="http://SOAPwebservices.dev/"
                  schemaLocation="http://localhost:8080/DA_Project/QuoteSoapServiceService?xsd=1"/>
    </xsd:schema>
  </types>
  <message name="getSpreuk">
    <part name="parameters" element="tns:getSpreuk"/>
  </message>
  <message name="getSpreukResponse">
    <part name="parameters" element="tns:getSpreukResponse"/>
  </message>
  <portType name="QuoteSoapService">
    <operation name="getSpreuk">
      <input wsam:Action="http://SOAPwebservices.dev/QuoteSoapService/getSpreukRequest" message="tns:getSpreuk"/>
      <output wsam:Action="http://SOAPwebservices.dev/QuoteSoapService/getSpreukResponse"
              message="tns:getSpreukResponse"/>
    </operation>
  </portType>
  <binding name="QuoteSoapServicePortBinding" type="tns:QuoteSoapService">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
    <operation name="getSpreuk">
      <soap:operation soapAction=""/>
      <input>
        <soap:body use="literal"/>
      </input>
      <output>
        <soap:body use="literal"/>
      </output>
    </operation>
  </binding>
  <service name="QuoteSoapServiceService">
    <port name="QuoteSoapServicePort" binding="tns:QuoteSoapServicePortBinding">
      <soap:address location="http://localhost:8080/DA_Project/QuoteSoapServiceService"/>
    </port>
  </service>
</definitions>
